{'id': 21, 'title': 'Sialosis: Cytomorphological significance in the diagnosis of an uncommon entity', 'title_translation': '唾液酸化：诊断不常见实体的细胞形态学意义', 'abstract': 'A diffuse, chronic, usually bilateral, noninflammatory, nonneoplastic enlargement of major salivary glands is termed as Sialosis or Sialadenosis. It is an extremely uncommon cause for enlargement of the parotid gland. We hereby present a case of a 45-year-old female patient having a swelling at the left preauricular region. The swelling was gradually increasing in size since 6 months. On clinical examination, the swelling was 3 cm × 3 cm, mobile, and nontender. On ultrasonography, it was suggestive of benign parotid lesion or parotitis with cervical lymphadenopathy. On fine needle aspiration cytology, it was suggestive of sialadenosis. This is an extremely rare salivary gland lesion with specific cellular features. It is very important to distinguish sialadenosis from other causes of enlargement of the parotid gland as treatment modality differs.', 'abstract_translation': '主要唾液腺的弥漫性，慢性，通常双侧，非炎性，非肿瘤性增生被称为唾液酸或唾液腺增生。这是扩大腮腺的极不寻常的原因。我们在此介绍一名45岁女性患者，在左前耳区发生肿胀。 6个月后肿胀逐渐增加。在临床检查中，肿胀为3厘米×3厘米，手术和非延髓。在超声检查中，提示良性腮腺病变或腮腺炎伴颈淋巴结肿大。细针穿刺细胞学检查显示唾液腺增生症。这是一种非常罕见的具有特异性细胞特征的唾液腺病变。因为治疗方式不同，区分唾液腺增生与腮腺肿大的其他原因是非常重要的。', 'year': 2017, 'url': 'http://www.jcytol.org/article.asp?issn=0970-9371;year=2017;volume=34;issue=1;spage=51;epage=52;aulast=Jagtap', 'start_page': '51', 'end_page': '52', 'article_created_date': '2017-01-19T06:36:18', 'article_last_updated': '2017-01-19T06:36:18', 'journals_publisher': 'Medknow Publications', 'journals_language': 'English', 'journals_licenseId': 1, 'journals_title': 'Journal of Cytology', 'journals_country': 'IN', 'journals_number': '1', 'journals_volume': '34', 'journals_issns': '0970-9371,0974-5165', 'journals_create_date': '2017-05-23T17:56:39', 'term': 'Science,Cytology,Biology (General)', 'term_code': 'Q,QH573-671,QH301-705.5', 'term_l1': 'Science', 'keyword': 'Cytology, parotid gland swelling, sialadenosis', 'keyword_translation': '细胞学,\xa0腮腺肿胀,\xa0唾液腺肿大', 'author_name': 'Sunil Vitthalrao Jagtap,Shakuntala S Aramani,Avinash Mane,Vijay Bonde', 'author_affiliation': None, 'author_email': None, 'identifier_type': 'pissn,doi', 'identifier_identifierId': '0970-9371,10.4103/0970-9371.197620', 'license_type': 'CC BY-NC-SA', 'license_title': 'CC BY-NC-SA', 'license_url': 'http://biodiversitas.mipa.uns.ac.id/D/ethics.htm'}
{'id': 54, 'title': 'Endometriosis mimicking glandular atypia in a cervical cytology', 'title_translation': '在子宫颈细胞学中模拟腺体异型的子宫内膜异位症', 'abstract': 'Endometriosis involving the uterine cervix is a rare condition that can lead to diagnostic errors in the interpretation of Pap smear. We report the case of a 41-year-old patient in whom the initial Pap smear revealed three-dimensional clusters of glandular cells with elongated nuclei, occasional mitosis, and atypia, which was interpreted as atypical glandular cells, not otherwise specified (NOS). The patient was taken to colposcopy and endocervical biopsy. Colposcopy was normal and the biopsy presented glands with elongated nuclei and surrounded by endometrial stroma admixed with normal endocervical glands. Immunohistochemical studies were reactive for CD10 in the stromal cells and vimentin in endometrioid glands. The findings were consistent with cervical endometriosis. Endometriosis in the cervix is an uncommon pathology that mimics malignancy and may be interpreted as atypical or glandular neoplasia in the cytology.', 'abstract_translation': '涉及子宫颈的子宫内膜异位症是导致巴氏涂片解读的诊断错误的罕见病症。我们报告了一名41岁的患者，其中最初的巴氏涂片显示具有细长的细胞核，偶尔的有丝分裂和非典型性的腺体细胞的三维簇，其被解释为非特异性腺细胞（NOS） 。患者被采取阴道镜检查和宫颈内活检。阴道镜检查是正常的，并且活检呈现细长的细胞核并且被子宫内膜基质包围的腺体与正常子宫颈腺体混合。免疫组织化学研究对基质细胞中的CD10和子宫内膜样腺体中的波形蛋白具有反应性。结果与宫颈子宫内膜异位症一致。子宫颈中的子宫内膜异位症是一种罕见的病理学模拟恶性肿瘤，可能被解释为细胞学中的非典型或腺体瘤形成。', 'year': 2017, 'url': 'http://www.jcytol.org/article.asp?issn=0970-9371;year=2017;volume=34;issue=1;spage=61;epage=63;aulast=Rodriguez-Urreg', 'start_page': '61', 'end_page': '63', 'article_created_date': '2017-01-19T06:36:21', 'article_last_updated': '2017-01-19T06:36:21', 'journals_publisher': 'Medknow Publications', 'journals_language': 'English', 'journals_licenseId': 1, 'journals_title': 'Journal of Cytology', 'journals_country': 'IN', 'journals_number': '1', 'journals_volume': '34', 'journals_issns': '0970-9371,0974-5165', 'journals_create_date': '2017-05-23T17:56:39', 'term': 'Science,Cytology,Biology (General)', 'term_code': 'Q,QH573-671,QH301-705.5', 'term_l1': 'Science', 'keyword': 'Atypical glandular cells of undetermined significance (AGUS), cervical cytology, endometriosis', 'keyword_translation': '不确定意义的非典型腺细胞（AGUS）,\xa0宫颈细胞学,\xa0子宫内膜异位症', 'author_name': 'Paula A Rodriguez-Urreg,Isabel C Dulcey-Hormiga,Luis E Barrera-Herrera,David A Suarez-Zamora,Mauricio A Palau-Lazaro,Catalina Buritica-Cifuentes', 'author_affiliation': None, 'author_email': None, 'identifier_type': 'pissn,doi', 'identifier_identifierId': '0970-9371,10.4103/0970-9371.197624', 'license_type': 'CC BY-NC-SA', 'license_title': 'CC BY-NC-SA', 'license_url': 'http://biodiversitas.mipa.uns.ac.id/D/ethics.htm'}
{'id': 65, 'title': 'Penicillium marneffei infection in a HIV-Positive patient: A comparison of bronchial washing cytology and biopsy', 'title_translation': '艾滋病毒阳性患者的马尼埃菲青霉感染：支气管洗涤细胞学和活检的比较', 'abstract': 'Penicilliosis is a disseminated and progressive infection that is mainly found in immunocompromised individuals, especially those with human immunodeficiency virus (HIV) infection. Because of the high mortality of patients with disseminated Penicillium marneffei infection, rapid diagnosis and early treatment are required. Diagnosis is traditionally made by biopsy and/or culture of blood or any involved organ. Cytology offers several advantages over biopsy, including more rapid diagnosis and greater resolution of cytomorphologic details of organisms, allowing rapid initiation of treatment. Here, we describe a case of penicilliosis in an HIV-positive patient with emphasis on the morphological characteristics of the organism in cytologic specimens, as well as a comparison of bronchial washing and biopsy findings.', 'abstract_translation': '青光眼病是一种传播性和进行性感染，主要发现于免疫受损的个体，特别是具有人类免疫缺陷病毒（HIV）感染者。由于传播性马尼埃病青光眼患者的死亡率高，需要进行快速诊断和早期治疗。传统上通过活检和/或血液或任何相关器官的培养进行诊断。细胞学提供了比活检更多的优点，包括更迅速的诊断和更高分辨率的生物细胞形态细节，允许快速开始治疗。在这里，我们描述了艾滋病毒阳性患者的青霉病病例，重点是细胞学标本中生物体的形态学特征，以及支气管洗涤和活检结果的比较。', 'year': 2017, 'url': 'http://www.jcytol.org/article.asp?issn=0970-9371;year=2017;volume=34;issue=1;spage=45;epage=48;aulast=Hee', 'start_page': '45', 'end_page': '48', 'article_created_date': '2017-01-19T06:36:16', 'article_last_updated': '2017-01-19T06:36:16', 'journals_publisher': 'Medknow Publications', 'journals_language': 'English', 'journals_licenseId': 1, 'journals_title': 'Journal of Cytology', 'journals_country': 'IN', 'journals_number': '1', 'journals_volume': '34', 'journals_issns': '0970-9371,0974-5165', 'journals_create_date': '2017-05-23T17:56:39', 'term': 'Science,Cytology,Biology (General)', 'term_code': 'Q,QH573-671,QH301-705.5', 'term_l1': 'Science', 'keyword': 'Bronchial washing cytology, HIV, penicilliosis', 'keyword_translation': '支气管清洗细胞学,\xa0HIV,\xa0青霉', 'author_name': 'Chu Hyun Hee,Chong Young Pil,Kyung Ja Cho', 'author_affiliation': None, 'author_email': None, 'identifier_type': 'pissn,doi', 'identifier_identifierId': '0970-9371,10.4103/0970-9371.197618', 'license_type': 'CC BY-NC-SA', 'license_title': 'CC BY-NC-SA', 'license_url': 'http://biodiversitas.mipa.uns.ac.id/D/ethics.htm'}
{'id': 89, 'title': 'Littoral cell angioma of the spleen: Cytological findings and review of the literature', 'title_translation': '脾细胞血管瘤：细胞学检查和文献综述', 'abstract': 'Littoral cell angioma (LCA) is a unique lesion of the spleen that arises from the cells lining the venous sinuses of the splenic red pulp and shows the features of combined endothelial and histiocytic differentiation. Several cases of LCA have been reported in the literature; however, the cytological findings have been described for only a few cases. We report the case of an 11-year-old boy with anemia, epigastric abdominal pain, and splenomegaly. The splenic lesions showed anastomosing vascular channels with cyst-like spaces filled by many sloughed endothelial cells, which were positive for CD68 and CD31 and negative for CD34. Scraping cytology revealed isolated and clusters of three-dimensional bland looking, epithelioid foamy tumoral cells with low nuclear cytoplasmic ratio, which mostly contained intracytoplasmic hemosiderin pigment. Although the fine needle aspiration cytology of splenic lesions is uncommon and LCA is a rare splenic lesion, it must be noted in the differential diagnosis of any splenic vascular neoplasm.', 'abstract_translation': '脊髓细胞血管瘤（LCA）是脾脏的独特病变，由脾脏红髓的静脉窦引起的细胞产生，并显示出组合内皮细胞和组织细胞分化的特征。文献报道了几例LCA;然而，细胞学检查结果仅在少数情况下进行了描述。我们报告了一名患有贫血，上腹部腹痛和脾肿大的11岁男孩的病例。脾脏病变显示吻合血管通道，囊肿状空间被许多脱落的内皮细胞填充，CD68和CD31阳性，CD34阴性。刮除细胞学显示分离和簇的三维平淡无光的上皮样泡沫肿瘤细胞具有低核细胞质比，其主要含有胞质内含铁血黄素色素。虽然脾脏病变的细针抽吸细胞学不常见，LCA是罕见的脾脏病变，但在任何脾血管肿瘤的鉴别诊断中必须注意。', 'year': 2017, 'url': 'http://www.jcytol.org/article.asp?issn=0970-9371;year=2017;volume=34;issue=2;spage=121;epage=124;aulast=Anbardar', 'start_page': '121', 'end_page': '124', 'article_created_date': '2017-04-18T11:11:11', 'article_last_updated': '2017-04-18T10:11:11', 'journals_publisher': 'Medknow Publications', 'journals_language': 'English', 'journals_licenseId': 1, 'journals_title': 'Journal of Cytology', 'journals_country': 'IN', 'journals_number': '2', 'journals_volume': '34', 'journals_issns': '0970-9371,0974-5165', 'journals_create_date': '2017-05-23T17:56:39', 'term': 'Science,Cytology,Biology (General)', 'term_code': 'Q,QH573-671,QH301-705.5', 'term_l1': 'Science', 'keyword': 'Cytology, littoral cell angioma, spleen', 'keyword_translation': '细胞学,\xa0沿海细胞血管瘤,\xa0脾', 'author_name': 'Mohammad H Anbardar,Perikala V Kumar,Hamid R Forootan', 'author_affiliation': None, 'author_email': None, 'identifier_type': 'pissn,doi', 'identifier_identifierId': '0970-9371,10.4103/JOC.JOC_118_15', 'license_type': 'CC BY-NC-SA', 'license_title': 'CC BY-NC-SA', 'license_url': 'http://biodiversitas.mipa.uns.ac.id/D/ethics.htm'}
{'id': 139, 'title': 'Design and Architecture of a Location and Time-based Mobile-Learning System: A Case-Study for Interactive Islamic Content', 'title_translation': '位置和时间移动学习系统的设计与架构：交互式伊斯兰教内容的案例研究', 'abstract': 'This paper describes a software design, architecture and process of a novel mobile-learning (m-Learning) approach based on smart-phone devices for retrieving relevant content in real-time based on the user’s-location and the current-time and presenting the content to the user in a manner that support portable learning on-the-move. Mobile-learning using Islamic content is used as a case-study of the proposed system, which can easily be adapted for other learning-content. The proposed system is highly interactive and frequently purges the host-device for details of the current user-location and current-time (e.g. the time, day and month in the solar and the lunar calendars) before such details are used to retrieve the most relevant content. In this study, Quranic-verses, corresponding interpretations (Tafseer) and Hadith (Prophetic words or actions) relates to the online content being fetched in this application. For example, a user may be performing some travel/pilgrimage during Ramadan, in which the relevant content/teachings (based on the user’s location and the current time) are presented to the user in a timely manner in order to learn the rituals of that day or location. The information fetched is then presented and displayed in an interactive user-friendly manner. A summary and comparative analysis of some related applications is presented, showing the limitations of other m-Learning applications and demonstrating the new contribution of our architecture design. Finally, the described system allows authorized scholars to upload and report Islamic-decrees made in real-time based on findings/experience at a particular time and/or location-of-interest (e.g. the new rulings/decrees are then published online in real-time). It is anticipated that millions of end-users shall benefit from the proposed system through the benefits of fast, highly-accessible, user-friendly and relevant information retrieved online in real-time. Advantageously, the potential application and large impact of the proposed m-Learning approach for use with other learning-content/courses is notable.', 'abstract_translation': '本文介绍了基于智能手机设备的基于用户位置和当前时间实时检索相关内容的新型移动学习（m-Learning）方法的软件设计，架构和过程，并呈现以支持便携式学习的方式向用户提供内容。将使用伊斯兰教内容的移动学习用作拟议系统的案例研究，可以轻松适应其他学习内容。所提出的系统是高度交互的，并且在使用这些细节用于检索最多的时间之前，经常清除主机设备以了解当前用户位置和当前时间（例如，太阳能和月球日历中的时间，日期和月份）的详细信息相关内容在这项研究中，古兰经经文，相应的解释（Tafseer）和圣训（Prophet words或Action）与本应用程序中提取的在线内容有关。例如，用户可能在斋月期间执行一些旅行/朝圣，其中相关内容/教义（基于用户的位置和当前时间）被及时地呈现给用户，以便学习该用户的仪式天或地点。然后以交互式的用户友好的方式呈现和显示所获取的信息。介绍了一些相关应用的总结和比较分析，显示了其他m-Learning应用程序的局限性，并展示了我们的架构设计的新贡献。最后，所描述的系统允许授权学者根据特定时间和/或利益位置的发现/经验实时上传和报告伊斯兰教法令（例如，新的裁决/法令在线实时发布-时间）。预计数百万终端用户将通过快速，高度访问，用户友好和实时在线检索的相关信息的好处，从拟议的系统中受益。有利的是，拟议的m-Learning方法与其他学习内容/课程的潜在应用和巨大的影响是值得注意的。', 'year': 2017, 'url': 'http://www.thesai.org/Downloads/Volume8No3/Paper_42-Design_and_Architecture_of_a_Location_and_Time-based_Mobile-Learning.pdf', 'start_page': '302', 'end_page': '308', 'article_created_date': '2017-04-21T09:33:22', 'article_last_updated': '2017-04-21T08:33:22', 'journals_publisher': 'The Science and Information (SAI) Organization', 'journals_language': 'English', 'journals_licenseId': 2, 'journals_title': 'International Journal of Advanced Computer Science and Applications', 'journals_country': 'US', 'journals_number': '3', 'journals_volume': '8', 'journals_issns': '2156-5570', 'journals_create_date': '2017-05-23T17:56:39', 'term': 'Electronic computers. Computer science,Instruments and machines,Mathematics,Science', 'term_code': 'QA75.5-76.95,QA71-90,QA1-939,Q', 'term_l1': 'Science', 'keyword': 'Mobile-Learning,Context-Aware Notifications,Time and Location Based Reporting,Interactive-Knowledge based User-Events and Activities,Design and Architecture', 'keyword_translation': '移动学习,上下文意识通知,时间和位置报告,基于交互式知识的用户事件和活动,设计与建筑', 'author_name': 'Omar Tayan,Moulay Ibrahim El-Khalil Ghembaza,Khalid Al-Oufi', 'author_affiliation': None, 'author_email': None, 'identifier_type': 'doi,eissn', 'identifier_identifierId': '10.14569/IJACSA.2017.080342,2156-5570', 'license_type': 'CC BY-NC-ND', 'license_title': 'CC BY-NC-ND', 'license_url': 'http://www.elsevier.com/journals/jaad-case-reports/2352-5126/open-access-journal'}
{'id': 140, 'title': 'ComplexCloudSim: Towards Understanding Complexity in QoS-Aware Cloud Scheduling', 'title_translation': 'ComplexCloudSim：了解QoS感知云调度中的复杂性', 'abstract': 'The cloud is generally assumed to be homogeneous in most of the research efforts related to cloud resource management and the performance of cloud resource can be determined as it is predictable. However, a plethora of complexities are associated with cloud resources in the real world: dynamicity, heterogeneity and uncertainty. For heterogeneous cloud resources experiencing vast dynamic changes in performance, a critical role is played by the statistical characteristics of execution times, related to different cloud resources, to facilitate decision making in management. The cloud’s performance can be considerably influenced by the differences between the estimated and actual execution times, which may affect the robustness of resource management systems. Limitation exists in the study of cloud resource management systems’ complexities even though extensive research has been done on complexity issues in various fields from decision making in economics to computational biology. This paper concentrates on managing the research question regarding the complexity’s role in QoS-aware cloud resource management systems. We present the ComplexCloudSim. Here, CloudSim, a popular simulation tool-kit, is extended through modelling of complexity factors in the cloud, including dynamic changes of run-time performance, resource heterogeneity, and task execution times’ uncertainty. The effects of complexity on performance within cloud environments are examined by comparing four widely used heuristic cloud scheduling algorithms, given that the execution time information is inaccurate. Furthermore, a damage spreading analysis, one amongst the available complex system analysis methods, is applied to the system and simulations are run to reveal the system’s sensitivity to initial conditions within specific parameter regions. Finally, how small of a damage can spread throughout the system within the region is discussed as well as research is done for the potential ways to avoid such chaotic behaviours and develop more robust systems.', 'abstract_translation': '在云资源管理的大部分研究工作中，云通常被认为是同质的，云资源的性能可以被确定为可预测的。然而，现实世界中云资源的复杂性过多：动态性，异质性和不确定性。对于经历性能巨大动态变化的异构云资源，与不同云资源相关的执行时间的统计特性起关键作用，以促进管理决策。云的性能可能受到估计和实际执行时间之间的差异的影响，这可能会影响资源管理系统的稳健性。即使对经济学决策到计算生物学的各个领域的复杂性问题进行了广泛的研究，云资源管理系统复杂性的研究存在限制。本文着重于管理关于QoS感知云资源管理系统中的复杂性角色的研究问题。我们呈现ComplexCloudSim。在这里，CloudSim是一种流行的模拟工具包，通过对云中复杂性因素的建模进行扩展，包括运行时性能的动态变化，资源异质性和任务执行时间的不确定性。考虑到执行时间信息不准确，通过比较四种广泛使用的启发式云调度算法来检查云环境中复杂性对性能的影响。此外，将可用的复杂系统分析方法之一的破坏扩散分析应用于系统，并进行仿真以揭示系统对特定参数区域内初始条件的敏感性。最后，讨论了该区域内整个系统的破坏程度有多小，同时还对避免这种混沌行为和开发更健壮的系统的潜在方法进行了研究。', 'year': 2017, 'url': 'http://www.thesai.org/Downloads/Volume8No3/Paper_2%20-ComplexCloudSim_Towards_Understanding.pdf', 'start_page': '9', 'end_page': '16', 'article_created_date': '2017-04-21T07:21:16', 'article_last_updated': '2017-04-21T06:21:16', 'journals_publisher': 'The Science and Information (SAI) Organization', 'journals_language': 'English', 'journals_licenseId': 2, 'journals_title': 'International Journal of Advanced Computer Science and Applications', 'journals_country': 'US', 'journals_number': '3', 'journals_volume': '8', 'journals_issns': '2156-5570', 'journals_create_date': '2017-05-23T17:56:39', 'term': 'Electronic computers. Computer science,Instruments and machines,Mathematics,Science', 'term_code': 'QA75.5-76.95,QA71-90,QA1-939,Q', 'term_l1': 'Science', 'keyword': 'Cloud Scheduling,Damage Spreading,QoS,Complexity,Chaotic Behaviour,Cloud Simulation', 'keyword_translation': '云计划,伤害蔓延,服务质量,复杂,混沌行为,云模拟', 'author_name': 'Huankai Chen,Frank Z Wang', 'author_affiliation': None, 'author_email': None, 'identifier_type': 'doi,eissn', 'identifier_identifierId': '10.14569/IJACSA.2017.080302,2156-5570', 'license_type': 'CC BY-NC-ND', 'license_title': 'CC BY-NC-ND', 'license_url': 'http://www.elsevier.com/journals/jaad-case-reports/2352-5126/open-access-journal'}
{'id': 142, 'title': 'Security and Privacy Risks Awareness for Bring Your Own Device (BYOD) Paradigm', 'title_translation': '安全隐私风险意识带来您自己的设备（BYOD）范式', 'abstract': 'The growing trend of BYOD in the higher education institutions creates a new form of student learning pedagogy in which students are able to use the mobile devices for their academic purposes in anywhere and anytime. Security threat in the paradigm of BYOD creates a great opportunity for hackers or attackers to find new attacks or vulnerabilities that could possibly exploit the students’ mobile devices and gains valuable data from them. A survey was conducted in learning the current awareness of security and privacy importance in BYOD for higher education in Malaysia. Based on the analysis of this survey, it demonstrates that the trend of BYOD in Malaysia has begun. Thoroughly, the survey results have been proven that the current basic fundamental security and privacy awareness and knowledge on mobile devices or applications is important in order to protect their mobile devices or data.', 'abstract_translation': 'BYOD在高等教育机构中的增长趋势创造了一种新形式的学生学习教学法，学生可以随时随地将移动设备用于学术目的。 BYOD范例中的安全威胁为黑客或攻击者找到可能利用学生移动设备并获得有价值的数据的新的攻击或漏洞创造了一个很好的机会。进行了一次调查，以了解目前马来西亚高等教育BYOD在安全和隐私方面的重要意识。根据本次调查的分析，显示马来西亚BYOD的趋势已经开始。调查结果完全证明，目前基本的基本安全和隐私意识以及移动设备或应用程序的知识对于保护移动设备或数据至关重要。', 'year': 2017, 'url': 'http://www.thesai.org/Downloads/Volume8No2/Paper_8-Security_and_Privacy_Risks_Awareness_for_Bring_Your_Own_Device.pdf', 'start_page': '53', 'end_page': '62', 'article_created_date': '2017-03-20T11:58:21', 'article_last_updated': '2017-03-20T11:58:21', 'journals_publisher': 'The Science and Information (SAI) Organization', 'journals_language': 'English', 'journals_licenseId': 2, 'journals_title': 'International Journal of Advanced Computer Science and Applications', 'journals_country': 'US', 'journals_number': '2', 'journals_volume': '8', 'journals_issns': '2156-5570', 'journals_create_date': '2017-05-23T17:56:39', 'term': 'Electronic computers. Computer science,Instruments and machines,Mathematics,Science', 'term_code': 'QA75.5-76.95,QA71-90,QA1-939,Q', 'term_l1': 'Science', 'keyword': 'Mobile Computing,BYOD Higher Education,Security,Privacy,Malicious Software,Risk', 'keyword_translation': '移动计算,BYOD高等教育,安全,隐私,恶意软件,风险', 'author_name': 'Manmeet Mahinderjit Singh,Chen Wai Chan,Zakiah Zulkefli', 'author_affiliation': None, 'author_email': None, 'identifier_type': 'doi,eissn', 'identifier_identifierId': '10.14569/IJACSA.2017.080208,2156-5570', 'license_type': 'CC BY-NC-ND', 'license_title': 'CC BY-NC-ND', 'license_url': 'http://www.elsevier.com/journals/jaad-case-reports/2352-5126/open-access-journal'}
{'id': 143, 'title': 'Block Wise Data Hiding with Auxilliary Matrix', 'title_translation': '使用辅助矩阵块智能数据隐藏', 'abstract': 'This paper introduces a novel method based on auxiliary matrix to hide a text data in an RGB plane. To hide the data in RGB planes of image via scanning, encryption and decryption. To enhance the security, the scanning technique combines two different traversals – spiral and snake traversal. The encryption algorithm involves auxiliary matrix as a payload and consider the least significant bits of three planes. To embed the text message would in the form of ASCII values which are similar to the red plane values and least significant value of pixels in blue plane marks the position of pixels. The least significant bit of boundary values of green-plane signifies the message. These three planes are recombined to form the stego-image, to decrypt the message with the help of scanning in the red-plane and blue plane and green plane simultaneously. Performance evaluation is done using PSNR, MSE and entropy calculation and generated results are compared with some earlier proposed work to present its efficiency with respect to others.', 'abstract_translation': '本文介绍了一种基于辅助矩阵的隐藏RGB平面文本数据的方法。通过扫描，加密和解密隐藏图像RGB平面中的数据。为了提高安全性，扫描技术结合了两种不同的遍历 - 螺旋和蛇遍历。加密算法涉及辅助矩阵作为有效载荷，并考虑三个平面的最低有效位。要以ASCII值的形式嵌入文本消息，类似于红色平面值，并且蓝色平面中的像素的最低有效值标记像素的位置。绿色平面的边界值的最低有效位表示消息。这三个平面被重组以形成隐形图像，借助于红平面和蓝平面以及绿平面同时进行扫描来解密消息。使用PSNR，MSE和熵计算进行性能评估，并将生成的结果与一些较早提出的工作进行比较，以提供其他方面的效率。', 'year': 2017, 'url': 'http://www.thesai.org/Downloads/Volume8No3/Paper_20-Block_Wise_Data_Hiding_with_Auxilliary_Matrix.pdf', 'start_page': '128', 'end_page': '135', 'article_created_date': '2017-04-21T08:06:13', 'article_last_updated': '2017-04-21T07:06:13', 'journals_publisher': 'The Science and Information (SAI) Organization', 'journals_language': 'English', 'journals_licenseId': 2, 'journals_title': 'International Journal of Advanced Computer Science and Applications', 'journals_country': 'US', 'journals_number': '3', 'journals_volume': '8', 'journals_issns': '2156-5570', 'journals_create_date': '2017-05-23T17:56:39', 'term': 'Electronic computers. Computer science,Instruments and machines,Mathematics,Science', 'term_code': 'QA75.5-76.95,QA71-90,QA1-939,Q', 'term_l1': 'Science', 'keyword': 'Steganography,RGB planes,Scanning,Stego-image,ASCII value', 'keyword_translation': '隐写术,RGB平面,扫描,隐秘图像,ASCII值', 'author_name': 'Jyoti Bharti,R.K. Pateriya,Sanyam Shukla', 'author_affiliation': None, 'author_email': None, 'identifier_type': 'doi,eissn', 'identifier_identifierId': '10.14569/IJACSA.2017.080320,2156-5570', 'license_type': 'CC BY-NC-ND', 'license_title': 'CC BY-NC-ND', 'license_url': 'http://www.elsevier.com/journals/jaad-case-reports/2352-5126/open-access-journal'}
{'id': 146, 'title': 'SIT: A Lightweight Encryption Algorithm for Secure Internet of Things', 'title_translation': 'SIT：安全物联网的轻量级加密算法', 'abstract': 'The Internet of Things (IoT) being a promising technology of the future is expected to connect billions of devices. The increased number of communication is expected to generate mountains of data and the security of data can be a threat. The devices in the architecture are essentially smaller in size and low powered. Conventional encryption algorithms are generally computationally expensive due to their complexity and requires many rounds to encrypt, essentially wasting the constrained energy of the gadgets. Less complex algorithm, however, may compromise the desired integrity. In this paper we propose a lightweight encryption algorithm named as Secure IoT (SIT). It is a 64-bit block cipher and requires 64-bit key to encrypt the data. The architecture of the algorithm is a mixture of feistel and a uniform substitution-permutation network. Simulations result shows the algorithm provides substantial security in just five encryption rounds. The hardware implementation of the algorithm is done on a low cost 8-bit micro-controller and the results of code size, memory utilization and encryption/decryption execution cycles are compared with benchmark encryption algo-rithms. The MATLAB code for relevant simulations is available online at https://goo.gl/Uw7E0W.', 'abstract_translation': '物联网（IoT）是未来有希望的技术，预计将连接数十亿台设备。通信量增加预计会产生山脉的数据，数据的安全性可能是一个威胁。架构中的设备基本上较小，功耗较小。常规的加密算法由于其复杂性而通常在计算上是昂贵的，并且需要许多轮加密，从而基本上浪费了小工具的约束能量。然而，较不复杂的算法可能会损害所需的完整性。在本文中，我们提出一种称为安全IoT（SIT）的轻量加密算法。它是一个64位的块密码，需要64位密钥加密数据。算法的架构是一个feistel和一个统一的置换置换网络的混合。仿真结果表明，该算法在仅五个加密周期中提供了实质的安全性。算法的硬件实现是在低成本的8位微控制器上实现的，并将代码大小，存储器利用率和加密/解密执行周期的结果与基准加密算法进行比较。用于相关模拟的MATLAB代码可在线获取，网址为https://goo.gl/Uw7E0W。', 'year': 2017, 'url': 'http://www.thesai.org/Downloads/Volume8No1/Paper_51-SIT_A_Lightweight_Encryption_Algorithm_for_Secure.pdf', 'start_page': '402', 'end_page': '411', 'article_created_date': '2017-02-13T06:42:38', 'article_last_updated': '2017-02-13T06:42:38', 'journals_publisher': 'The Science and Information (SAI) Organization', 'journals_language': 'English', 'journals_licenseId': 2, 'journals_title': 'International Journal of Advanced Computer Science and Applications', 'journals_country': 'US', 'journals_number': '1', 'journals_volume': '8', 'journals_issns': '2156-5570', 'journals_create_date': '2017-05-23T17:56:39', 'term': 'Electronic computers. Computer science,Instruments and machines,Mathematics,Science', 'term_code': 'QA75.5-76.95,QA71-90,QA1-939,Q', 'term_l1': 'Science', 'keyword': 'Security,IoT,Encryption,Wireless Sensor Network WSN,Khazad', 'keyword_translation': '安全,物联网,加密,无线传感器网络WSN,Khazad', 'author_name': 'Muhammad Usman,Irfan Ahmed,M. Imran Aslam,Shujaat Khan,Usman Ali Shah', 'author_affiliation': None, 'author_email': None, 'identifier_type': 'doi,eissn', 'identifier_identifierId': '10.14569/IJACSA.2017.080151,2156-5570', 'license_type': 'CC BY-NC-ND', 'license_title': 'CC BY-NC-ND', 'license_url': 'http://www.elsevier.com/journals/jaad-case-reports/2352-5126/open-access-journal'}
{'id': 147, 'title': 'Sentiment Classification of Twitter Data Belonging to Saudi Arabian Telecommunication Companies', 'title_translation': 'Twitter数据属于沙特阿拉伯电信公司的情绪分类', 'abstract': 'Twitter has attracted the attention of many re-searchers owing to the fact that every tweet is, by default, public in nature which is not the case with Facebook. In this paper, we present sentiment analysis of tweets written in English, belonging to different telecommunication companies in Saudi Arabia. We apply different machine learning algorithms such as k nearest neighbor algorithm, Artificial Neural Networks (ANN), Na¨ive Bayesian etc. We classified the tweets into positive, negative and neutral classes based on Euclidean distance as well as cosine similarity. Moreover, we also learned similarity matrices for kNN classification. CfsSubsetEvaluation as well as Information Gain was used for feature selection. The results of CfsSubsetEvaluation were better than the ones obtained with Information Gain. Moreover, kNN performed better than the other algorithms and gave 75.4%, 76.6% and 75.6% for Precision, Recall and F-measure, respectively. We were able to get an accuracy of 80.1%with a symmetric variant of kNN while using cosine similarity. Furthermore, interesting trends wrt days, months etc. were also discovered.', 'abstract_translation': 'Twitter已经引起了许多重新搜索者的关注，因为默认情况下，每个推文都是公开的，而Facebook不是这样。在本文中，我们介绍了沙特阿拉伯属于不同电信公司的英文推文的情绪分析。我们应用不同的机器学习算法，如k最近邻算法，人工神经网络（ANN），Na贝叶斯等。我们基于欧几里得距离和余弦相似性将推文分为正，负和中性类。此外，我们还学习了kNN分类的相似矩阵。 CfsSubsetEvaluation以及信息增益被用于特征选择。 CfsSubsetEvaluation的结果比用信息增益获得的结果更好。此外，kNN表现优于其他算法，分别为Precision，Recall和F-measure的75.4％，76.6％和75.6％。我们能够使用kNN的对称变体获得80.1％的精度，同时使用余弦相似度。此外，还发现了日，月等有趣的趋势。', 'year': 2017, 'url': 'http://www.thesai.org/Downloads/Volume8No1/Paper_50-Sentiment_Classification_of_Twitter_Data_Belonging.pdf', 'start_page': '395', 'end_page': '401', 'article_created_date': '2017-02-13T06:41:05', 'article_last_updated': '2017-02-13T06:41:05', 'journals_publisher': 'The Science and Information (SAI) Organization', 'journals_language': 'English', 'journals_licenseId': 2, 'journals_title': 'International Journal of Advanced Computer Science and Applications', 'journals_country': 'US', 'journals_number': '1', 'journals_volume': '8', 'journals_issns': '2156-5570', 'journals_create_date': '2017-05-23T17:56:39', 'term': 'Electronic computers. Computer science,Instruments and machines,Mathematics,Science', 'term_code': 'QA75.5-76.95,QA71-90,QA1-939,Q', 'term_l1': 'Science', 'keyword': 'sentiment analysis,social networks,supervised machine learning,text mining', 'keyword_translation': '情绪分析,社交网络,监督机器学习,文字挖掘', 'author_name': 'Ali Mustafa Qamar,Suliman A. Alsuhibany,Syed Sohail Ahmed', 'author_affiliation': None, 'author_email': None, 'identifier_type': 'doi,eissn', 'identifier_identifierId': '10.14569/IJACSA.2017.080150,2156-5570', 'license_type': 'CC BY-NC-ND', 'license_title': 'CC BY-NC-ND', 'license_url': 'http://www.elsevier.com/journals/jaad-case-reports/2352-5126/open-access-journal'}
{'id': 148, 'title': 'A Trust and Reputation Model for Quality Assessment of Online Content', 'title_translation': '在线内容质量评估的信任和声誉模型', 'abstract': 'In recent years, online transactions have become more prevalent than it was. This means that the number of online users to perform such transactions keeps growing, causing an increase in the level of expectations for them. One of those expectations is to enable them to get a better understanding of such transactions before going ahead with it. Consequently, trust and reputation models represent an important milestone to support those users to make their own decisions to facilitate online transactions. Many of the common trust and reputation models used primitive methods to calculate the reputation of online content. These methods are usually inaccurate when there is a divergence in rating. In addition, the lack of predictability through the latter ratings in emerging trends. Others use a probabilistic model or the so-called weighted average, which usually focusing on a single dimension for online user ratings. Even those models that combine multiple dimensions of user ratings are usually not representative on the one hand, and on the other hand are with heterogeneous weights. This paper fills this gap by proposing a model to assess the trust and reputation of online content, relying on three factors namely user behavior, user reliability, and user tendency with homogeneous weights of interest to the user on the Internet. These homogenous weights will be used to measure the reputation of any online content. The proposed model has been validated and compared with some other well-known models, and showed a significant improvement in terms of the Mean Absolute Error (MAE). The proposed model is also good with sparse and dense datasets.', 'abstract_translation': '近年来，网络交易已经变得比现在更加流行。这意味着执行此类交易的在线用户数量不断增加，从而导致对他们的期望水平的提高。其中一个期望是让他们在开始之前更好地了解这些交易。因此，信任和信誉模型是支持这些用户做出自己的决定以促进在线交易的重要里程碑。许多常见的信任和声誉模型使用原始方法来计算在线内容的声誉。当评级分歧时，这些方法通常是不准确的。另外，通过后者的评级在新兴趋势中缺乏可预测性。其他人使用概率模型或所谓的加权平均值，通常将重点放在单一维度上进行在线用户评级。即使那些组合用户评分的多个维度的模型一方面通常也不具有代表性，另一方面则是具有不均匀的权重。本文通过提出一种模型来评估在线内容的信任和声誉，依靠用户行为，用户可靠性和用户倾向与用户在互联网上感兴趣的均匀权重三个因素来填补这一空白。这些均匀权重将用于衡量任何在线内容的声誉。所提出的模型已经被验证并与其他一些众所周知的模型进行了比较，并且在平均绝对误差（MAE）方面显示出显着的改进。所提出的模型对于稀疏和密集的数据集也很好。', 'year': 2017, 'url': 'http://www.thesai.org/Downloads/Volume8No3/Paper_9-A_Trust_and_Reputation_Model_for_Quality.pdf', 'start_page': '58', 'end_page': '61', 'article_created_date': '2017-04-21T07:33:08', 'article_last_updated': '2017-04-21T06:33:08', 'journals_publisher': 'The Science and Information (SAI) Organization', 'journals_language': 'English', 'journals_licenseId': 2, 'journals_title': 'International Journal of Advanced Computer Science and Applications', 'journals_country': 'US', 'journals_number': '3', 'journals_volume': '8', 'journals_issns': '2156-5570', 'journals_create_date': '2017-05-23T17:56:39', 'term': 'Electronic computers. Computer science,Instruments and machines,Mathematics,Science', 'term_code': 'QA75.5-76.95,QA71-90,QA1-939,Q', 'term_l1': 'Science', 'keyword': 'Online content,Quality assessment,Trust and reputation model,User behaviour,User reliability,user tendency', 'keyword_translation': '在线内容,质量评估,信任和信誉模式,用户行为,用户可靠性,用户倾向', 'author_name': 'Yousef Elsheikh', 'author_affiliation': None, 'author_email': None, 'identifier_type': 'doi,eissn', 'identifier_identifierId': '10.14569/IJACSA.2017.080309,2156-5570', 'license_type': 'CC BY-NC-ND', 'license_title': 'CC BY-NC-ND', 'license_url': 'http://www.elsevier.com/journals/jaad-case-reports/2352-5126/open-access-journal'}
{'id': 150, 'title': 'Antenna Performance Improvement Techniques for Energy Harvesting: A Review Study', 'title_translation': '天线性能改进技术的能量收获：审查研究', 'abstract': 'The energy harvesting is defined as using energy that is available within the environment to increase the efficiency of any application. Moreover, this method is recognized as a useful way to break down the limitation of battery power for wireless devices. In this paper, several antenna designs of energy harvesting are introduced. The improved results are summarized as a 2×2 patch array antenna realizes improved efficiency by 3.9 times higher than the single patch antenna. The antenna has enhanced the bandwidth of 22.5 MHz after load two slots on the patch. The solar cell antenna is allowing harvesting energy during daylight. A couple of E-patches antennas have increased the bandwidth of 33% and the directivity up to 20 dBi. The received power can be improved by 1.2-1.4 times when using the dual port on pixel antenna. Complementary split ring resonator and substrate integrated waveguide are utilized cavity-backed feeding on a fractal patch antenna to enhance the bandwidth around 5.1%. Moreover, adding a rectifier circuit to an antenna converts the reserved RF-signal to DC power, and then duplicated the input voltage up to sum the total number of rectifier circuit stages. Therefore, the advantages and disadvantages of each antenna depend on the technique which used in design.', 'abstract_translation': '能量收集被定义为使用环境中可用的能量来提高任何应用的效率。此外，该方法被认为是分解无线设备的电池电量限制的有用方式。在本文中，介绍了几种能量收集的天线设计。改进的结果总结为2×2贴片阵列天线，实现了比单贴片天线提高3.9倍的效率。天线在片上加载两个插槽后，增强了22.5 MHz的带宽。太阳能电池天线允许在白天捕获能量。几个E贴片天线增加了33％的带宽，方向性增加到20 dBi。当使用像素天线上的双端口时，接收功率可以提高1.2-1.4倍。互补分裂环谐振器和衬底集成波导在分形贴片天线上利用空腔支撑馈电，以提高约5.1％的带宽。此外，向天线添加整流电路将保留的RF信号转换为DC电力，然后将输入电压复制为总和整流电路级的总和。因此，每个天线的优点和缺点取决于设计中使用的技术。', 'year': 2017, 'url': 'http://www.thesai.org/Downloads/Volume8No1/Paper_14-Antenna_Performance_Improvement_Techniques.pdf', 'start_page': '97', 'end_page': '102', 'article_created_date': '2017-02-13T05:01:25', 'article_last_updated': '2017-02-13T05:01:25', 'journals_publisher': 'The Science and Information (SAI) Organization', 'journals_language': 'English', 'journals_licenseId': 2, 'journals_title': 'International Journal of Advanced Computer Science and Applications', 'journals_country': 'US', 'journals_number': '1', 'journals_volume': '8', 'journals_issns': '2156-5570', 'journals_create_date': '2017-05-23T17:56:39', 'term': 'Electronic computers. Computer science,Instruments and machines,Mathematics,Science', 'term_code': 'QA75.5-76.95,QA71-90,QA1-939,Q', 'term_l1': 'Science', 'keyword': 'energy harvesting,slotted patch,circularly polarization,solar substrate,rectenna', 'keyword_translation': '能量收集,开槽补丁,圆极化,太阳能基板,整流天线', 'author_name': 'Raed Abdulkareem Abdulhasan,Abdulrashid O. Mumin,Yasir A. Jawhar,Mustafa S. Ahmed,Rozlan Alias,Khairun Nidzam Ramli,Mariyam Jamilah Homam,Lukman Hanif Muhammad Audah', 'author_affiliation': None, 'author_email': None, 'identifier_type': 'doi,eissn', 'identifier_identifierId': '10.14569/IJACSA.2017.080114,2156-5570', 'license_type': 'CC BY-NC-ND', 'license_title': 'CC BY-NC-ND', 'license_url': 'http://www.elsevier.com/journals/jaad-case-reports/2352-5126/open-access-journal'}
{'id': 151, 'title': 'Wireless Sensor Network Energy Efficiency with Fuzzy Improved Heuristic A-Star Method', 'title_translation': '无线传感器网络能量效率与模糊改进的启发式A星方法', 'abstract': 'Energy is a major factor in designing wireless sensor networks (WSNs). In order to extend the network lifetime, researchers should consider energy consumption in routing protocols of WSNs. Routing will serve to facilitate a number of sensors on the technology of WSNs to identify the optimal path and manage energy consumption saving at the time of transmitting data. Current Wireless Sensor Networks efficiency system uses node selection as the main parameter without applying path finding routing. It will not complete the optimization of energy. This research was designed to address the problem of energy optimization by using fuzzy-improved heuristic A-Star. A new algorithm named improved heuristic A-Star was developed from previous A-Star algorithm. The result of fuzzy-improved heuristic A-Star indicated node sensor to sink destination saved 0.3698 joule energy dissipation which resulted in longer lifetime.', 'abstract_translation': '能量是设计无线传感器网络（WSN）的主要因素。为了延长网络寿命，研究人员应考虑无线传感器网络路由协议中的能耗。路由将有助于WSNs技术上的一些传感器识别最佳路径，并在传输数据时节省能耗。当前无线传感器网络效率系统使用节点选择作为主要参数，而不应用路径查找路由。不能完成能源的优化。该研究旨在通过使用模糊改进的启发式A星来解决能量优化问题。以前的A-Star算法开发了一种名为改进型启发式A-Star的新算法。模糊改进的启发式A-Star的结果表明节点传感器到目的地节省了0.3698焦耳能量耗散，导致更长的使用寿命。', 'year': 2017, 'url': 'http://www.thesai.org/Downloads/Volume8No4/Paper_43-Wireless_Sensor_Network_Energy_Efficiency.pdf', 'start_page': '311', 'end_page': '316', 'article_created_date': '2017-05-11T13:07:31', 'article_last_updated': '2017-05-11T12:07:31', 'journals_publisher': 'The Science and Information (SAI) Organization', 'journals_language': 'English', 'journals_licenseId': 2, 'journals_title': 'International Journal of Advanced Computer Science and Applications', 'journals_country': 'US', 'journals_number': '4', 'journals_volume': '8', 'journals_issns': '2156-5570', 'journals_create_date': '2017-05-23T17:56:39', 'term': 'Electronic computers. Computer science,Instruments and machines,Mathematics,Science', 'term_code': 'QA75.5-76.95,QA71-90,QA1-939,Q', 'term_l1': 'Science', 'keyword': 'Improved Heuristic A-Star,Fuzzy Logic,Wireless Sensor Network', 'keyword_translation': '改进的启发式A星,模糊逻辑,无线传感器网络', 'author_name': 'Sigit Soijoyo,Retantyo Wardoyo', 'author_affiliation': None, 'author_email': None, 'identifier_type': 'doi,eissn', 'identifier_identifierId': '10.14569/IJACSA.2017.080443,2156-5570', 'license_type': 'CC BY-NC-ND', 'license_title': 'CC BY-NC-ND', 'license_url': 'http://www.elsevier.com/journals/jaad-case-reports/2352-5126/open-access-journal'}
{'id': 152, 'title': 'An Improved Machine Learning Approach to Enhance the Predictive Accuracy for Screening Potential Active USP1/UAF1 Inhibitors', 'title_translation': '改进的机器学习方法，以提高筛选潜在活性USP1 / UAF1抑制剂的预测精度', 'abstract': 'DNA repair mechanism is an important mechanism employed by the cancerous cell to survive the DNA damages induced during uncontrolled proliferation of cell and anti-cancer drug treatments. In this context, the Ubiquitin-Specific Proteases (USP1) in complex with Ubiquitin Associated Factor 1(UAF1) plays a key role in the survival of cancerous cell by DNA repair mechanism. Thus, this put forth USP1/UAF1 complex as a striking anti-cancer target for screening of anti-cancer molecule. The current research is aimed to improve the classification accuracy of the existing bioactivity predictive chemoinformatics model for screening potential active USP1/UAF1 inhibitors from high-throughput screening data. The current study employed feature selection method to extract key molecular descriptors from the publicly available high-throughput screening dataset of small molecules that were used to screen active USP1/UAF1 complex inhibitors. This study proposes an improved predictive machine learning approach using the feature selection technique and two class Linear Discriminant Technique (LDA) algorithm to accurately predict the active novel USP1/UAF1 inhibitor compounds.', 'abstract_translation': 'DNA修复机制是癌细胞在细胞和抗癌药物治疗不受控制的增殖期间诱导的DNA损伤中存活的重要机制。在本文中，与泛素相关因子1（UAF1）复合的泛素特异性蛋白酶（USP1）通过DNA修复机制在癌细胞的存活中起关键作用。因此，这提出了USP1 / UAF1复合物作为抗癌分子筛选的醒目抗癌靶标。目前的研究旨在提高现有生物活性预测化学信息学模型的分类准确性，从高通量筛选数据筛选潜在的活性USP1 / UAF1抑制剂。目前的研究采用特征选择方法从用于筛选活性USP1 / UAF1复合抑制剂的小分子的公开的高通量筛选数据集中提取关键分子描述符。本研究提出了一种改进的预测机器学习方法，使用特征选择技术和两类线性判别技术（LDA）算法准确预测活性新型USP1 / UAF1抑制剂化合物。', 'year': 2017, 'url': 'http://www.thesai.org/Downloads/Volume8No4/Paper_21-An_Improved_Machine_Learning_Approach_to_Enhance.pdf', 'start_page': '144', 'end_page': '148', 'article_created_date': '2017-05-11T12:09:33', 'article_last_updated': '2017-05-11T11:09:33', 'journals_publisher': 'The Science and Information (SAI) Organization', 'journals_language': 'English', 'journals_licenseId': 2, 'journals_title': 'International Journal of Advanced Computer Science and Applications', 'journals_country': 'US', 'journals_number': '4', 'journals_volume': '8', 'journals_issns': '2156-5570', 'journals_create_date': '2017-05-23T17:56:39', 'term': 'Electronic computers. Computer science,Instruments and machines,Mathematics,Science', 'term_code': 'QA75.5-76.95,QA71-90,QA1-939,Q', 'term_l1': 'Science', 'keyword': 'Ubiquitinases,DNA repair mechanism,anti USP1/UAF1 molecule,High-throughput Dataset,Feature Selection and Discriminant Technique,Chemoinformatic Model,Classification accuracy,T-test', 'keyword_translation': 'Ubiquitinases,DNA修复机制,抗USP1 / UAF1分子,高吞吐量数据集,特征选择与鉴别技术,化学信息模型,分类精度,T-测试', 'author_name': 'Syed Asif Hassan,Ahmed Hamza Osman', 'author_affiliation': None, 'author_email': None, 'identifier_type': 'doi,eissn', 'identifier_identifierId': '10.14569/IJACSA.2017.080421,2156-5570', 'license_type': 'CC BY-NC-ND', 'license_title': 'CC BY-NC-ND', 'license_url': 'http://www.elsevier.com/journals/jaad-case-reports/2352-5126/open-access-journal'}
{'id': 153, 'title': 'Observation of Scintillation Events from GPS and NavIC (IRNSS) Measurements at Bangalore Region', 'title_translation': '观察班加罗尔地区GPS和NavIC（IRNSS）测量的闪烁事件', 'abstract': 'Ionosphere scintillation is a random phenomenon of the ionosphere, causing abrupt fluctuations in the amplitude and phase of the signals traversing the medium, significantly impacting the performance of navigation systems, signifying the need to take up scintillation studies. Scintillation events are monitored on L5, S and L1 band signals of IRNSS and GPS navigation system respectively over low latitude Bangalore region during moderate and low solar activity period, 2015 and 2016 respectively. Investigations into scintillation variability with respect to local time, solar activity and seasonal variations are conducted to draw a trend of scintillation pattern. Comparison of L5 and L1 band scintillation events demonstrate similar scintillation pattern with varying scintillation magnitude. With S band signals exhibit minimum scintillation, suggesting the scintillation-free link for effective navigation.', 'abstract_translation': '电离层闪烁是电离层的随机现象，引起穿过介质的信号的幅度和相位的突然波动，显着影响导航系统的性能，这意味着需要进行闪烁研究。分别在2015年和2016年的中太阳活动期间分别在低纬度班加罗尔地区的IRNSS和GPS导航系统的L5，S和L1频带信号上监测闪烁事件。对当地时间，太阳活动和季节变化的闪烁变异性进行调查，以绘制闪烁图案的趋势。 L5和L1波段闪烁事件的比较表明具有不同闪烁幅度的相似的闪烁图案。 S波段信号表现出最小的闪烁，表明无闪烁链接有效导航。', 'year': 2017, 'url': 'http://www.thesai.org/Downloads/Volume8No4/Paper_29-Observation_of_Scintillation_Events_from_GPS.pdf', 'start_page': '206', 'end_page': '210', 'article_created_date': '2017-05-11T12:25:48', 'article_last_updated': '2017-05-11T11:25:48', 'journals_publisher': 'The Science and Information (SAI) Organization', 'journals_language': 'English', 'journals_licenseId': 2, 'journals_title': 'International Journal of Advanced Computer Science and Applications', 'journals_country': 'US', 'journals_number': '4', 'journals_volume': '8', 'journals_issns': '2156-5570', 'journals_create_date': '2017-05-23T17:56:39', 'term': 'Electronic computers. Computer science,Instruments and machines,Mathematics,Science', 'term_code': 'QA75.5-76.95,QA71-90,QA1-939,Q', 'term_l1': 'Science', 'keyword': 'Ionosphere scintillation,Navigation,carrier to noise ratio,solar activity,equinox', 'keyword_translation': '电离层闪烁,导航,载噪比,太阳活动,春分', 'author_name': 'Manjula T R,Raju Garudachar', 'author_affiliation': None, 'author_email': None, 'identifier_type': 'doi,eissn', 'identifier_identifierId': '10.14569/IJACSA.2017.080429,2156-5570', 'license_type': 'CC BY-NC-ND', 'license_title': 'CC BY-NC-ND', 'license_url': 'http://www.elsevier.com/journals/jaad-case-reports/2352-5126/open-access-journal'}
{'id': 154, 'title': 'Segmentation of Brain Tumor in Multimodal MRI using Histogram Differencing & KNN', 'title_translation': '使用直方图差分和KNN在多模态MRI中分割脑肿瘤', 'abstract': 'Tumor segmentation inside the brain MRI is one of the trickiest and demanding subjects for the research community due to the complex nature and structure of the human brain and the different types of abnormalities that grow inside the brain. A Few common types of tumors are CNS Lymphoma, Meningioma, Glioblastoma, and Metastases. In this research work, our aim is to segment and classify the four most commonly diagnosed types of brain tumors. To segment the four most common brain tumors, we are proposing a new demanding dataset comprising of multimodal MRI along with healthy brain MRI images. The dataset contains 2000 images collected from online sources of about 80 patient cases. Segmentation method proposed in this research is based on histogram differencing with rank filter. Morphology at post-processing is practically implemented to detect the brain tumor more evidently. The KNN classification is applied to classify tumor values into their respective category (i.e. benign and malignant) based on the size value of tumor. The average rate of True Classification Rate (TCR) achieved is 97.3% and False Classification Rate (FCR) is 2.7%.', 'abstract_translation': '由于人脑复杂的性质和结构以及大脑内部不同类型的异常，大脑MRI内部的肿瘤分割是研究界棘手和难题之一。少数常见类型的肿瘤是CNS淋巴瘤，脑膜瘤，成胶质细胞瘤和转移瘤。在这项研究工作中，我们的目的是分割和分类四种最常诊断的脑肿瘤类型。为了分割四个最常见的脑肿瘤，我们提出了一个新的要求数据集，包括多模态MRI以及健康的脑MRI图像。该数据集包含从大约80例患者病例的在线来源收集的2000张图像。本研究提出的分割方法是基于与秩滤波器的直方图差分。后期处理中的形态学实际上可以用于更明显地检测脑肿瘤。应用KNN分类法将肿瘤值分类为各自的类别（即良性和恶性），基于肿瘤的大小值。真实分类率（TCR）的平均率为97.3％，假分类率（FCR）为2.7％。', 'year': 2017, 'url': 'http://www.thesai.org/Downloads/Volume8No4/Paper_34-Segmentation_of_Brain_Tumor_in_Multimodal_MRI.pdf', 'start_page': '249', 'end_page': '256', 'article_created_date': '2017-05-11T12:47:55', 'article_last_updated': '2017-05-11T11:47:55', 'journals_publisher': 'The Science and Information (SAI) Organization', 'journals_language': 'English', 'journals_licenseId': 2, 'journals_title': 'International Journal of Advanced Computer Science and Applications', 'journals_country': 'US', 'journals_number': '4', 'journals_volume': '8', 'journals_issns': '2156-5570', 'journals_create_date': '2017-05-23T17:56:39', 'term': 'Electronic computers. Computer science,Instruments and machines,Mathematics,Science', 'term_code': 'QA75.5-76.95,QA71-90,QA1-939,Q', 'term_l1': 'Science', 'keyword': 'MRI imaging,tumor types,image segmentation,Histogram Differencing,KNN', 'keyword_translation': 'MRI成像,肿瘤类型,图像分割,直方图差异,KNN', 'author_name': 'Qazi Nida-Ur-Rehman,Imran Ahmed,Ghulam Masood,Najam-U-Saquib,Muhammad Khan,Awais Adnan', 'author_affiliation': None, 'author_email': None, 'identifier_type': 'doi,eissn', 'identifier_identifierId': '10.14569/IJACSA.2017.080434,2156-5570', 'license_type': 'CC BY-NC-ND', 'license_title': 'CC BY-NC-ND', 'license_url': 'http://www.elsevier.com/journals/jaad-case-reports/2352-5126/open-access-journal'}
{'id': 155, 'title': 'ISOLATION AND CHARACTERIZATION OF TRIACYLGLYCEROL ACCUMULATING MICROORGANISMS FOR BIODIESEL PRODUCTION', 'title_translation': '用于生物体生产的三聚氰胺累积微生物的分离和表征', 'abstract': 'Triacylglycerol is an important feedstock for biodiesel production. In this study, several strains of oleaginous bacteria were isolated from environmental sample based on their ability to grow on mineral salts medium supplemented with wood derived sugars such as cellulose, arabinose, xylose, mannose, and galactose. The lipid accumulating bacteria were selected on the basis of fluorescent signal from hydrophobic inclusion in the cytoplasm after incubation in selective medium containing lipophilic dye 0.5 % (w/v) nile red. The lipid content was analyzed using thin layer chromatography (TLC) and gas chromatography-mass spectrometry (GC-MS). In this study, three bacterial isolates 2HPCS1R4, 1LPCS2R2, and 1LPCS2R14 were selected among several studied candidates. TLC analysis of hydrophobic substance from 1LPCS2R2 and 1LPCS2R14 showed two overlapped discrete bands corresponded to triacylglycerol reference band, while 2HPCS1R4 displayed a faint band located above the reference band. GC-MS analysis confirmed that the bands consisted of fatty acid methyl esters with alkyl length varied from C12 to C17. Kinetic study showed that the fastest growing strain was 1LPCS2R2 had the highest growth rates and grown in glucose (µ = 0.29 h-1 ) and xylose (µ = 0.16 h-1 ). In conclusion, this study has identified of prospective bacterial isolates for commercial biodiesel production', 'abstract_translation': '三酰甘油是生物柴油生产的重要原料。在这项研究中， 基于它们在矿物上生长的能力，从环境样品中分离含油细菌 补充有木衍生糖的盐培养基如纤维素，阿拉伯糖，木糖，甘露糖， 和半乳糖。基于荧光信号选择脂肪蓄积细菌 在含有亲脂性染料的选择培养基中孵育后，细胞质中的疏水包合 0.5％（w / v）尼罗红。使用薄层色谱（TLC）和气体分析脂质含量 色谱 - 质谱（GC-MS）。在本研究中，三株细菌分离株2HPCS1R4， 1LPCS2R2和1LPCS2R14在几个研究候选人中选出。 TLC分析 1LPCS2R2和1LPCS2R14的疏水物质显示两个重叠的离散条带 对应于三酰基甘油参考带，2HPCS1R4显示位于上方的微弱带 参考乐队。 GC-MS分析证实，该条带由脂肪酸甲基酯组成 烷基长度从C12到C17不等。动力学研究表明，生长最快的菌株是 1LPCS2R2生长速度最快，葡萄糖生长（μ= 0.29 h-1） ）和木糖（μ= 0.16h-1 ）。 总之，本研究已经确定了商业生物柴油的前瞻性细菌分离物 生产', 'year': 2017, 'url': 'http://jebas.org/Jou.Exp.Bio.Agr.Sci/Vol5_17_Issue_N1/10.18006_2017.5(1).111.119.pdf', 'start_page': '111', 'end_page': '119', 'article_created_date': '2017-03-21T23:18:28', 'article_last_updated': '2017-03-21T23:18:28', 'journals_publisher': 'Journal of Experimental Biology and Agricultural Sciences', 'journals_language': 'English', 'journals_licenseId': 2, 'journals_title': 'Journal of Experimental Biology and Agricultural Sciences', 'journals_country': 'IN', 'journals_number': 'I', 'journals_volume': '5', 'journals_issns': '2320-8694', 'journals_create_date': '2017-05-23T17:56:39', 'term': 'Science,Biology (General)', 'term_code': 'Q,QH301-705.5', 'term_l1': 'Science', 'keyword': 'Triacylglycerol,Biodiesel,Oleaginous microorganisms,Nile red,Thin layer chromatography (TLC),High performance liquid chromatography (HPLC)', 'keyword_translation': '甘油三酯,生物柴油,油性微生物,尼罗红,薄层色谱（TLC）,高效液相色谱（HPLC）', 'author_name': 'Sony Adhi Susanto', 'author_affiliation': 'Institut Teknologi Del, Jl. Sisingamangaraja, Sitoluama, Laguboti, Toba Samosir Regency, North Sumatera, Postal Code: 22381.', 'author_email': None, 'identifier_type': 'eissn,doi', 'identifier_identifierId': '2320-8694,http://dx.doi.org/10.18006/2017.5(1).111.119', 'license_type': 'CC BY-NC-ND', 'license_title': 'CC BY-NC-ND', 'license_url': 'http://www.elsevier.com/journals/jaad-case-reports/2352-5126/open-access-journal'}
{'id': 156, 'title': 'Prediction Method for Large Diatom Appearance with Meteorological Data and MODIS Derived Turbidity and Chlorophyll-A in Ariake Bay Area in Japan', 'title_translation': '日本的Ariake湾地区气象资料和MODIS派生浊度和叶绿素A大型硅藻外观的预测方法', 'abstract': 'Prediction method for large diatom appearance in winter with meteorological data and MODIS derived turbidity and chlorophyll-a in Ariake Bay Area in Japan is proposed. Mechanism for large diatom appearance in winter is discussed with the influencing factors, meteorological condition and in-situ data of turbidity, chlorophyll-a data with the measuring instruments equipped at the Saga University own Tower in the Ariake Bay area. Particularly, the method for estimation of turbidity is still under discussion. Therefore, the algorithm for estimation of turbidity with MODIS data is proposed here. Through experiments, it is found that the proposed prediction method for large diatom appearance is validated with the meteorological data and MODIS derived turbidity as well as chlorophyll-a data estimated for the winter (from January to March) in 2012 and 2015.', 'abstract_translation': '提出了冬季大型硅藻外观的预测方法，其中气象资料和MODIS得出的浊度和叶绿素a在日本的Ariake湾地区。讨论冬季大型硅藻外观的影响因素，气象条件和浊度的原位数据，叶绿素a数据与佐贺大学自然大学塔区Ariake Bay地区配备的测量仪器。特别是浊度估算方法尚待讨论。因此，本文提出了利用MODIS数据估计浊度的算法。通过实验，发现2012年和2015年，冬季（从1月到3月）的气象数据和MODIS衍生浊度以及估计的叶绿素a数据，提出了大型硅藻外观的预测方法。', 'year': 2017, 'url': 'http://www.thesai.org/Downloads/Volume8No3/Paper_6-Prediction_Method_for_Large_Diatom_Appearance.pdf', 'start_page': '39', 'end_page': '44', 'article_created_date': '2017-04-21T07:27:53', 'article_last_updated': '2017-04-21T06:27:53', 'journals_publisher': 'The Science and Information (SAI) Organization', 'journals_language': 'English', 'journals_licenseId': 2, 'journals_title': 'International Journal of Advanced Computer Science and Applications', 'journals_country': 'US', 'journals_number': '3', 'journals_volume': '8', 'journals_issns': '2156-5570', 'journals_create_date': '2017-05-23T17:56:39', 'term': 'Electronic computers. Computer science,Instruments and machines,Mathematics,Science', 'term_code': 'QA75.5-76.95,QA71-90,QA1-939,Q', 'term_l1': 'Science', 'keyword': 'chlorophyl-a concentration,red tide,diatom,MODIS,satellite remote sensing', 'keyword_translation': '叶绿素a浓度,赤潮,硅藻,MODIS,卫星遥感', 'author_name': 'Kohei Arai', 'author_affiliation': None, 'author_email': None, 'identifier_type': 'doi,eissn', 'identifier_identifierId': '10.14569/IJACSA.2017.080306,2156-5570', 'license_type': 'CC BY-NC-ND', 'license_title': 'CC BY-NC-ND', 'license_url': 'http://www.elsevier.com/journals/jaad-case-reports/2352-5126/open-access-journal'}
{'id': 158, 'title': 'Modern Authentication Techniques in Smart Phones: Security and Usability Perspective', 'title_translation': '智能手机中的现代认证技术：安全性和可用性视角', 'abstract': 'A smartphone has more advanced computing ability and connectivity than basic featured phones. Presently, we are moving from the Internet society to a mobile society where more and more access to the information is required. This has resulted in a mobile security which is no longer immanent, but imperative. Smartphone authentication has received substantial attention of the research community for the past several years because there have been modern developments beyond the classical PINs and passwords making user authentication more challenging. In this paper, we critically analyze the attacks and the vulnerabilities in smartphones’ authentication mechanisms. A comparative analysis of different authentication techniques along with the usage of the different authentication methods is discussed which lead the end-user towards choosing the most suitable and customizable authentication technique.', 'abstract_translation': '智能手机具有比基本功能手机更先进的计算能力和连接性。目前，我们正在从互联网社会转移到需要越来越多的信息访问的移动社会。这导致移动安全性不再是内在的，而是势在必行。智能手机认证在过去几年受到了研究界的重视，因为现有的开发超越了传统的PIN和密码，使得用户认证更具挑战性。在本文中，我们对智能手机认证机制中的攻击和漏洞进行了批判性的分析。讨论了不同认证技术的比较分析以及不同认证方法的使用，导致最终用户选择最合适和可定制的认证技术。', 'year': 2017, 'url': 'http://www.thesai.org/Downloads/Volume8No1/Paper_42-Modern_Authentication_Techniques_in_Smart_Phones.pdf', 'start_page': '331', 'end_page': '340', 'article_created_date': '2017-02-13T06:22:04', 'article_last_updated': '2017-02-13T06:22:04', 'journals_publisher': 'The Science and Information (SAI) Organization', 'journals_language': 'English', 'journals_licenseId': 2, 'journals_title': 'International Journal of Advanced Computer Science and Applications', 'journals_country': 'US', 'journals_number': '1', 'journals_volume': '8', 'journals_issns': '2156-5570', 'journals_create_date': '2017-05-23T17:56:39', 'term': 'Electronic computers. Computer science,Instruments and machines,Mathematics,Science', 'term_code': 'QA75.5-76.95,QA71-90,QA1-939,Q', 'term_l1': 'Science', 'keyword': 'Security,smartphone,authentication,attacks,knowledge-based', 'keyword_translation': '安全,手机,认证,攻击,以知识为基础', 'author_name': 'Usman Shafique,Hikmat Khan,Sabah-ud-din Waqar,Asma Sher,Adnan Zeb,Uferah Shafi,Rahim Ullah,Rehmat Ullah,Faisal Bashir,Munam Ali Shah', 'author_affiliation': None, 'author_email': None, 'identifier_type': 'doi,eissn', 'identifier_identifierId': '10.14569/IJACSA.2017.080142,2156-5570', 'license_type': 'CC BY-NC-ND', 'license_title': 'CC BY-NC-ND', 'license_url': 'http://www.elsevier.com/journals/jaad-case-reports/2352-5126/open-access-journal'}
{'id': 159, 'title': 'An Empirical Investigation of the Correlation between Package-Level Cohesion and Maintenance Effort', 'title_translation': '封装层次凝聚力与维护努力相关性的实证调查', 'abstract': 'The quality of the software design has a considerable impact on software maintainability. Improving software quality can reduce costs and efforts of software maintenance. Cohesion, as one of software quality characteristics, can be used as an early indicator for predicting software maintenance efforts. This paper improves Martin’s cohesion metric, which is one of the well-known and well-accepted cohesion metrics. The strong correlation found between package cohesion, using our proposed metric, and maintenance efforts shows the improvement made on measuring cohesion, and how it would be for predicting maintenance efforts. The experimental study included data from four open source Java software systems. The results show that as good the package cohesion is, as the less maintenance effort will be needed.', 'abstract_translation': '软件设计的质量对软件可维护性有很大的影响。提高软件质量可以降低软件维护的成本和努力。作为软件质量特性之一的凝聚力可以​​作为预测软件维护工作的早期指标。本文提高了Martin的凝聚​​力度量，这是众所周知和公认的凝聚力指标之一。使用我们提出的指标和维护工作之间的包装凝聚力之间的强相关性显示了测量内聚力的改进以及如何预测维护工作。实验研究包括来自四个开源Java软件系统的数据。结果表明，随着维护努力的减少，包装的凝聚力也是一样好。', 'year': 2017, 'url': 'http://www.thesai.org/Downloads/Volume8No3/Paper_27-An_Empirical_Investigation_of_the_Correlation.pdf', 'start_page': '186', 'end_page': '191', 'article_created_date': '2017-04-21T08:19:51', 'article_last_updated': '2017-04-21T07:19:51', 'journals_publisher': 'The Science and Information (SAI) Organization', 'journals_language': 'English', 'journals_licenseId': 2, 'journals_title': 'International Journal of Advanced Computer Science and Applications', 'journals_country': 'US', 'journals_number': '3', 'journals_volume': '8', 'journals_issns': '2156-5570', 'journals_create_date': '2017-05-23T17:56:39', 'term': 'Electronic computers. Computer science,Instruments and machines,Mathematics,Science', 'term_code': 'QA75.5-76.95,QA71-90,QA1-939,Q', 'term_l1': 'Science', 'keyword': 'package,cohesion,metric,maintenance effort,maintainability,software,measurements', 'keyword_translation': '包,凝聚,公,维护工作,可维护性,软件,测量', 'author_name': 'Waleed Albattah', 'author_affiliation': None, 'author_email': None, 'identifier_type': 'doi,eissn', 'identifier_identifierId': '10.14569/IJACSA.2017.080327,2156-5570', 'license_type': 'CC BY-NC-ND', 'license_title': 'CC BY-NC-ND', 'license_url': 'http://www.elsevier.com/journals/jaad-case-reports/2352-5126/open-access-journal'}
