<div class="xx-nrzi">
<p>&nbsp;Greenwave Systems是一家物联网软件和服务供应商，该公司已在新加坡开设一家新的研发中心，并期望持续扩大规模。在全球范围内，该公司拥有四家办事处，员工总数约230人。</p>
<p>&nbsp;Greenwave Systems的研究中心位于新加坡的西部，其研究重点为为其顾客和合作伙伴提供先进的物联网技术。据国际数据公司研究显示，全球物联网市场总额将从2013年的1.9万亿美元增长至2020年的7.1万亿美元。新加坡政府目标建设"智能国家"，因此也在推动这一领域的发展。</p>
<p>&nbsp;</p>
</div>
<p>&nbsp;</p>

<div>Camera 360 Ultimate&rdquo;,不仅对用户的照片进行了优化，但也不经意间泄露了隐私数据，可以让恶意的用户不经过认证就接触到用户Camera 360的云账户和照片。</div>
<div>Camera360有多种相机拍摄模式，能拍摄出不同风格、不同特效的照片，特效相机里还提供了丰富的特效滤镜，不会PS可轻松拍出大师级照片。它还支持拍后照片的编辑，并且可以把照片分享到微博、微信等主流社交网站。Camera360全球用户近4.5亿，Camera360还提供云服务：用户创建一个云账户后可通过登录cloud.camera360.com进行访问。Camera360通过验证用户名和密码来保护云，但是当访问云时，Camera360 App将会在安卓系统日志(logcat)以及网络通信中以加密方式泄露用户隐私数据。应用可以读取logcat，或者获取网络通信从而盗取数据。假设恶意攻击者现在与你处在同一WiFi环境，可以使用WiFi sniffing轻松盗取数据。</div>
<div><img style="display: block; margin-left: auto; margin-right: auto;" src="http://image.3001.net/images/20150820/14400697583576.jpg!small" alt="" /></div>
<div>
<p>camera 360在网络通信和Android系统日志中泄露了很多未加密的隐私数据，这些漏洞可以使用中间人攻击进行利用，并且其对用户的隐私数据构成严重的威胁。</p>
</div>

<p>&nbsp; &nbsp; &nbsp; 苏黎世联邦理工学院（ETH Z&uuml;rich）的复杂材料研究人员开发出了一种3D打印方法来开发设计具有精美微结构特征的复合材料。在此之前，这种结构特征只在自然生长的生物材料中见到过。利用这种&ldquo;多材料磁力辅助3D打印系统（MM-3D printing），研究团队已经有效地超越了3D成型能力，甚至进入了一种5D设计空间。据称这一技术最终可以开发出多功能的变形软装置，这种装置可以用于创建类似人体肌腱或者肌肉的机械连接系统，或者制造软机器人的选择性拾取-放置系统等。</p>
<p>　　研究人员认为，将多种材料融合在一个3D打印对象中就为创建动态可编程的对象创造了可能性&mdash;&mdash;这种可能性我们已经看到了，比如使用加载了阴极和阳极材料的油墨实现微型锂离子电池的直接布线；或者将细胞与生物相容性水凝胶结合起来探讨组织再生的可能性等等。这些3D打印的设计往往类似于自然界中活细胞生长生物材料的方法，但是直到现在，人类设计的结果也没有达到与之相同的复杂水平。&ldquo;与常规的3D打印技术相比，活细胞所具备的独立局部成份和纹理控制水平至少多出了两个自由度（或者维度）。&rdquo;他们解释说。<br />　　而受到自然界中复杂多样的构建方式的启发&mdash;&mdash;比如植物能够根据环境因素的影响改变自己的形状&mdash;&mdash;研究者们设计了&ldquo;一种可以在5D设计空间编程并制造合成微结构的增材制造方法。&rdquo;所谓的5D设计空间，指的是除了增材制造的3D成型能力之外，还包括了合成物的本地控制（1D）和颗粒方向（另外1D）。</p>
<p>　　在天工社网站中，我们已经接触到了一些4D打印的技术，比如那些使用3D打印的形状记忆高分子材料创建的复杂的自我折叠结构等。而为了实现&ldquo;5D可编程性&rdquo;，瑞士研究人员使用了一种将具有磁响应属性的颗粒悬浮在液态光敏树脂中制成的墨水。随后他们改装了一台商业3D打印机&mdash;&mdash;3DDiscovery公司的regenHU，并用它来沉积墨水。<br />　　改装后的3D打印机配备了四个可独立寻址定位的注射器，每个注射器里可盛放不同配方的墨水。这台3D打印机上还安装了一个由两个部件组成的混合/分配单元，并由该单元来控油墨组成的变化。至于墨水，研究人员使用了两种具有不同流变特性的墨水：具有粘弹性的&ldquo;成型&rdquo;墨水，用于生成外框；低粘度的&ldquo;纹理&rdquo;墨水，用于轮廓内的打印。</p>
<p>　　带内部螺旋楼梯的MM-3D打印对象。&ldquo;成型&rdquo;墨水被指示为灰色，而&ldquo;纹理&rdquo;墨水被指示为米色。周边的黑色图案则代表了光刻掩模<br />　　为了展示自己开发的MM-3D打印平台所具备的定向、复合和形状控制能力，研究人员打印出了一个具有复杂形状以及与自然界完全不同的非均质精细微结构的3D对象（见上图）。他们将这个对象成为&ldquo;螺旋&rdquo;，该对象的外部呈现了各种不同的凸起和凹陷的曲面，而其内部则将众多小片汇集成螺旋楼梯的形式，从底部一直延伸到顶部。整个对象的大小仅为18毫米，其圆形底座直径为16毫米，顶部直径为10毫米，总共由60个圆形层组成。科学家们称，这种极端复杂的小尺寸3D打印对象代表了一种更加先进的人造物体，这种物体比以前更加接近于生物材料和植物系统中那种丰富、复杂、高效的几何形式。<br />　　研究者还能够使用这种3D打印平台创造出软性的机械紧固零件和3D变形的锁键连接器。&ldquo;虽然可以设想许多其他功能，但我们提供的例子包括利用非均质复合材料的形变来制造软性的机械紧固件，这种紧固件的工作原理非常特殊，它不需要任何化学粘合，完全可以根据紧固系统预先编程好的形状变化带驱动不同部件之间的机械互锁。&rdquo;<br />　　他们提出这种紧固系统可以创建类似人体肌腱或者肌肉的机械连接系统，或者这种可重新设置的锁键连接器也可以用作能够自主触发的灵活关节等。</p>
<p>　　<br />　　这项研究的领导者为Dimitri Kokkinis、Manuel Schaffner和Andr&eacute; R. Studart，并得到了美国空军科学研究办公室、瑞士国家竞争力与研究中心（NCCR）和苏黎世联邦理工学院的资助。</p>


<table cellspacing="0" cellpadding="0" hspace="0" vspace="0"><tbody><tr class="firstRow"><td style="BORDER-BOTTOM: #ffffff; BORDER-LEFT: #ffffff; PADDING-BOTTOM: 0px; BACKGROUND-COLOR: transparent; PADDING-LEFT: 12px; PADDING-RIGHT: 12px; WORD-BREAK: break-all; BORDER-TOP: #ffffff; BORDER-RIGHT: #ffffff; PADDING-TOP: 0px" valign="top"><p style="TEXT-ALIGN: left; TEXT-INDENT: 0em"><span style="FONT-FAMILY: 宋体; COLOR: black">日前 Avaya和另外两家公司宣布加入了OpenDaylight，截至目前该组织已经有35名成员，其目标是推动软件定义网络(SDN)和网络功能虚拟化(NFV)应用。</span></p></td></tr></tbody></table><p><span style="FONT-FAMILY: 宋体; COLOR: black; FONT-SIZE: 14px">自2013年4月成立以来，这个由Linux基金会监管的组织其成员规模已经翻番。OpenDaylight由思科、IBM等16家成员发起，致力于开发开放的SDN的平台。</span></p><p>&nbsp;</p>


<br/><p>11月18日消息，此前一直被誉为“跳票王”的土曼今天再次在京东众筹推出了全新的金属版T-Fire智能手表，众筹阶段，售价649元。<br/>全新的金属版T-Fire智能手表是土曼智能手表的第二代产品，屏幕部分虽然依旧采用了黑白E-ink电子墨水屏，但表盘边框采用了金属材质，拥有玫瑰金配棕表带和爵士黑配黑表带两种款式，标称续航时间可达15天。<br/>该款智能手表内部采用了Android 4.4操作系统，芯片方案采用了Mips，支持蓝牙，除了拥有来电接听、消息提醒、运动记步等基本功能外，还支持实时语音通信、地图导航、地理位置显示以及健康管理等功能。<br/>此前，土曼的第一代产品从去年9月公布以来，在经历几次跳票后，直到12月22日，土曼科技才迟迟的发出第一批测试工程机T-Fire，数量也被限定为500台，由此引发了不少预购用户的抗议和媒体的猜疑。<br/>据此前媒体报道，“对硬件制造难度的预估不足”是土曼科技第一代产品频繁跳票的主要原因。另外，之前土曼官方也曾就跳票问题发出过道歉信，称跳票的原因是由于时间问题没有进行大规模测试，为了避免产品大面积出现问题影响用户体验，所以才决定将首批产品作为测试版发给用户。<br/><br/></p>

<div class="xx-nrzi">
<p>&nbsp;Greenwave Systems是一家物联网软件和服务供应商，该公司已在新加坡开设一家新的研发中心，并期望持续扩大规模。在全球范围内，该公司拥有四家办事处，员工总数约230人。</p>
<p>&nbsp;Greenwave Systems的研究中心位于新加坡的西部，其研究重点为为其顾客和合作伙伴提供先进的物联网技术。据国际数据公司研究显示，全球物联网市场总额将从2013年的1.9万亿美元增长至2020年的7.1万亿美元。新加坡政府目标建设"智能国家"，因此也在推动这一领域的发展。</p>
<p>&nbsp;</p>
</div>
<p>&nbsp;</p>